EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet/inputs/ASJet_simpleFoam_kOmega/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pOut            8.4505e+04;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{
    axis
    {
        type            empty;
	}
    inlet
    {
        type            totalPressure;
        rho             none;
        p0              uniform 1.0113e+05;
        value           uniform 1.0113e+05;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            zeroGradient;
    }
    inflow1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            zeroGradient;
    }
    inflow2
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    wall3
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
