EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet/inputs/ASJet_simpleFoam_kOmega/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       8881;
    }
    inlet
    {
        type            patch;
        nFaces          24;
        startFace       8881;
    }
    wedge1
    {
        type            wedge;
        nFaces          4520;
        startFace       8905;
    }
    wedge2
    {
        type            wedge;
        nFaces          4520;
        startFace       13425;
    }
    wall1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          24;
        startFace       17945;
    }
    inflow1
    {
        type            patch;
        nFaces          24;
        startFace       17969;
    }
    wall2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          15;
        startFace       17993;
    }
    inflow2
    {
        type            patch;
        nFaces          79;
        startFace       18008;
    }
    outlet
    {
        type            patch;
        nFaces          56;
        startFace       18087;
    }
    wall3
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8;
        startFace       18143;
    }
)

// ************************************************************************* //
